Revit 2027 API
NumberingSchema.GetNumberOfPartitions Method
 Get the number of partitions managed by the schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfPartitions()
Public Function GetNumberOfPartitions As Integer
public:
int GetNumberOfPartitions()
member GetNumberOfPartitions : unit -> int
Return Value
Int32
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace